Revit 2027 API
ParameterTypeId.ViewAnalysisResultsVisibility Property
 "Analysis Display Settings"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewAnalysisResultsVisibility { get; }
Public Shared ReadOnly Property ViewAnalysisResultsVisibility As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewAnalysisResultsVisibility {
	ForgeTypeId^ get ();
}
static member ViewAnalysisResultsVisibility : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace